{
  "name": "Guilherme Bernardo da Nóbrega",
  "title": "Full Stack Web Developer and Project Manager",
  "aboutMe": "Full Stack Web Developer, with an emphasis on Front-end and project leader with proven proficiency in agile methodologies and a passion for technological innovation that add great value with fast delivery of results, meeting excellent deadlines. I stand out in creating dynamic web applications using advanced stacks - HTML, CSS, JavaScript, TypeScript, Node.JS, React, VTEX, among many others. My difference lies in the ability to transform complex ideas into intuitive and maintainable web systems, ensuring an exceptional user experience and the necessary scalability for long-term business success. With a track record of leading my own ventures, I demonstrate not only technical but also strategic vision and effective team management, resulting in high-impact deliveries. Meticulous documentation and software architecture are the backbone core of my work, ensuring solutions that exceed expectations and support continuous growth. Furthermore, I have advanced English, with fluent listening and speaking in accelerated development, allowing me excellent collaborations in international environments and adaptability to different technological cultures.",
  "experiences": [
    {
      "type": "agency",
      "name": "Wicomm",
      "link": "https://wicomm.com.br/",
      "projects": [
        {
          "name": "AD Fashion",
          "url": "https://www.adlifestyle.com.br",
          "thumbnail": "/thumbnail/ad-fashion.png"
        },
        {
          "name": "Toy Mania",
          "url": "https://www.toymania.com.br",
          "thumbnail": "/thumbnail/toy-mania.png"
        },
        {
          "name": "King & Joe",
          "url": "https://www.kingjoe.com.br",
          "thumbnail": "/thumbnail/king-joe.png"
        },
        {
          "name": "Ladeira Bijuterias",
          "url": "https://www.ladeirabijuterias.com.br",
          "thumbnail": "/thumbnail/ladeira-bijuterias.png"
        }
      ]
    },
    {
      "type": "education",
      "name": "Kenzie Academy",
      "link": "https://www.kenzie.com.br/",
      "projects": [
        {
          "name": "Kenzie Hub",
          "description": "Login interface and user profile MVP."
        },
        {
          "name": "user-API-Express",
          "description": "Client Area API."
        },
        {
          "name": "Movie Play",
          "description": "Movie API and Database."
        },
        {
          "name": "API Monday - Virtual Assistant",
          "description": "The purpose of this project is to create a means of interaction between a database and a FrontEnd application based on a virtual assistant."
        },
        {
          "name": "Monday VA",
          "description": "User interface that consumes data from the created API."
        }
      ]
    }
  ],
  "managementHistory": [
    "Event and Culture Producer at Sistema Fator de Ensino",
    "Founder of family business: Bernardo's"
  ],
  "softSkills": [
    {
      "title": "Humanism",
      "text": "Committed to creating meaningful work that benefits people. I believe that technology should be used to improve the quality of life and the human experience."
    },
    {
      "title": "Research and Development",
      "text": "Passionate about research and development, always looking for new ways to solve problems or optimize existing solutions."
    },
    {
      "title": "Modeling and Management",
      "text": "Effective modeling and management skills, optimizing processes and enhancing team collaboration."
    },
    {
      "title": "Communication and Maintenance of Corporate Culture",
      "text": "Promoting meaningful collaboration and fostering an exceptional work culture."
    },
    {
      "title": "Data and Evidence-Based Actions",
      "text": "Data-driven approach to problem solving and decision making."
    },
    {
      "title": "Complex, Critical, Holistic, and Procedural Vision",
      "text": "Ability to address complex problems with critical and holistic thinking, maintaining a process-oriented perspective."
    },
    {
      "title": "Customer-Oriented Market Vision",
      "text": "Customer-oriented mindset, committed to solving their problems and meeting their needs."
    }
  ],
  "hardSkills": {
    "frontEnd": [
      "HTML",
      "CSS",
      "JavaScript",
      "TypeScript",
      "React",
      "Styled Components",
      "TailWind", 
      "⋯"
    ],
    "backEnd": [
      "Node.JS",
      "ExpressJS",
      "Prisma",
      "Python",
      "C#",
      "SQL", 
      "⋯"
    ],
    "librariesAndFrameworks": [
      "ContextAPI",
      "Yup",
      "React-router-dom",
      "Framer Motion", 
      "⋯"
    ],
    "devOps": [
      "Docker",
      "postegreSQL",
      "Django",
      "AWS",
      "Google Cloud", 
      "⋯"
    ],
    "apis": [
      "Axios",
      "REST",
      "WebSocket",
      "GraphQL", 
      "⋯"
    ],
    "designAndPlanning": [
      "Figma",
      "Notion",
      "Photoshop",
      "Scrum",
      "PDCA",
      "Gantt Chart",
      "BSG", 
      "⋯"
    ]
  },
  "testimonials": [
    {
      "name": "Alexandre Borges de Albuquerque",
      "title": "Full-Stack Web Developer",
      "text": "I had the honor of developing with Guilherme on a group project we participated in. With his entrepreneurial profile, Guilherme does not shy away from challenges, looks for new challenges and when he encounters a barrier, he uses his creativity and resilience to overcome problems. The team that has Guilherme as a participant will not worry about the comfort zone as he himself does not conform, always looking for a problem to solve with proactivity, creativity, and A LOT of dedication."
    },
    {
      "name": "Álvaro Alencar",
      "title": "Full Stack Engineer",
      "text": "Highly organized professional with excellent communication skills."
    }
  ],
  "contact": {
    "phone": "+5521986368650",
    "email": "guilhermebernardo@id.uff.br",
    "github": "guilhermebernar"
  }
}